
var trains = [];
//路線データ登録エリア
/* template

trains.push({
    name : "name",
    id : "id",
    stations : [
        ["station1", "sort name", "num1"],
        ["station2", "sort name", "num2"],
    ]
});

*/

//0
trains.push({
  name: "一村線",
  id: "IC",
  color: "#0099FF",
  stations: [
    ["初原", "はつはら", "01"],
    ["一村", "いちむら", "02"],
    ["高台", "たかだい", "03"],
    ["金泉", "かないずみ", "04"],
    ["珊瑚口", "さんごぐち", "05"],
  ]
});

//1
trains.push({
  name: "岸川線",
  id: "KW",
  color: "#339900",
  stations: [
    ["金泉", "かないずみ", "01"],
    ["沼井", "ぬまい", "02"],
    ["心愛", "ここあ", "03"],
    ["岸川", "きしかわ", "04"],
    ["遠北", "あちきた", "05"],
    ["高台", "たかだい", "06"],
    ["神隠", "こうがくれ", "07"],
  ]
});

//2
trains.push({
  name: "高野線",
  id: "TN",
  color: "#00FF00",
  stations: [
    ["砂口", "すなぐち", "01"],
    ["北一村", "きたいちむら", "02"],
    ["一村", "いちむら", "03"],
    ["ファミリーマート", "ふぁみりーまーと", "04"],
    ["商店街前", "しょうてんがいまえ", "05"],
    ["高台", "たかだい", "06"],
    ["本高台", "ほんたかだい", "07"],
    ["矢野", "やの", "08"],
  ],
  Direct: {
    "金剛線": "矢野",
  }
});


//3
trains.push({
  name: "ネザーエクスプレス線",
  id: "NT",
  color: "#FF00FF",
  stations: [
    ["地終", "ちのばて", "00"],
    ["高台", "たかだい", "01"],
    ["珊瑚口", "さんごぐち", "02"],
    ["海底神殿", "かいていしんでん", "03"],
    ["メサランド", "めさらんど", "04"],
  ]
});

//4
trains.push({
  name: "水谷線",
  id: "MT",
  color: "#FF6600",
  stations: [
    ["高台", "たかだい", "10"],
    ["浮島", "うきしま", "11"],
    ["水谷", "みずたに", "12"],
    ["沼井", "ぬまい", "13"],
    ["金泉", "かないずみ", "14"],
    ["碑文田", "ひもんだ", "15"],
    ["新碑文田", "しんひもんだ", "16"],
  ],
  Direct: {
    "桜庭線": "高台",
    "雉鉄本線": "新碑文田",
  }
});

//5
trains.push({
  name: "桜庭線",
  id: "SK",
  color: "#FF66FF",
  stations: [
    ["明神市", "みょうじんし", "01"],
    ["花園城址公園", "はなぞのじょうしこうえん", "02"],
    ["蓮苔溝無", "ばすごけみぞなし", "03"],
    ["山入", "やまいり", "04"],
    ["勿咲", "なさき", "05"],
    ["漆ノ森", "しちのもり", "06"],
    ["草船", "くさぶね", "07"],
    ["湿塚", "しめつか", "08"],
    ["一村", "いちむら", "09"],
    ["高台", "たかだい", "10"],
  ],
});

//6
trains.push({
  name: "矢野線",
  id: "YN",
  color: "#FF0000",
  stations: [
    ["高台", "たかだい", "10"],
    ["矢野", "やの", "11"],
    ["ひまわりの里", "ひまわりのさと", "12"],
    ["因町", "ちなみまち", "13"],
    ["燧灘", "ひうちなだ", "14"],
    ["地終", "ちのばて", "15"],
  ],
  Direct: {
    "桜庭線": "高台",
  }
});

//7
trains.push({
  name: "雉鉄本線",
  id: "KH",
  color: "#006699",
  stations: [
    ["新碑文田", "しんひもんだ", "16"],
    ["新月町", "しんげつちょう", "17"],
    ["サウスサイドフロンティア", "さうすさいどふろんてぃあ", "18"],
  ],
  Direct: {
    "水谷線": "新碑文田",
  }
});

//8
trains.push({
  name: "ピリド線",
  id: "PR",
  color: "#999999",
  stations: [
    ["燧灘", "ひうちなだ", "1"],
    ["燧灘庁舎", "ひうちなだちょうしゃ", "2"],
  ]
});

//9
trains.push({
  name: "金剛線",
  id: "KG",
  color: "#000000",
  stations: [
    ["矢野", "やの", "01"],
    ["採掘場入口", "さいくつじょういりぐち", "02"],
    ["地下拠点", "ちかきょてん", "03"],
    ["第二採掘区画終点", "だいにさいくつくかくしゅうてん", "04"],
    ["第三採掘区画終点", "だいさんさいくつくかくしゅうてん", "05"],
    ["地下大渓谷", "ちかだいけいこく", "06"],
  ],
  Direct: {
    "高野線": "矢野",
  }
});

//10
trains.push({
  name: "ケダマ村電線",
  id: "",
  color: "#C0C040",
  stations: [
    ["農場前", "のうじょうまえ", ""],
    ["ひまわりの里", "ひまわりのさと", ""],
    ["公民館", "こうみんかん", ""],
    ["蔗", "さとうきび", ""],
    ["キャンプ場前", "きゃんぷじょうまえ", ""],
    ["洞窟前", "どうくつまえ", ""],
    ["旅人", "たびびと", ""],
    ["農場裏", "のうじょううら", ""],
  ],
  loop: true,
});

//11
trains.push({
  name: "市鉄本線",
  id: "IR",
  color: "#6600CC",
  stations: [
    ["高台", "たかだい", "01"],
    ["水谷", "みずたに", "02"],
    ["丸山", "まるやま", "03"],
    ["山吹", "やまぶき", "04"],
    ["草船", "くさぶね", "05"],
    ["花園", "はなぞの", "06"],
    ["明神", "みょうじん", "07"],
  ]
});

//12
trains.push({
  name: "市鉄支線",
  id: "",
  color: "#0000FF",
  stations: [
    ["山吹", "やまぶき", ""],
    ["牛込", "うしごめ", ""],
  ]
});

//13
trains.push({
  name: "海底神殿線",
  id: "",
  color: "#000000",
  stations: [
    ["海底神殿", "かいていしんでん", ""],
    ["海上ポート", "かいじょうぽーと", ""],
  ]
});