
var trains = [];
//路線データ登録エリア
/* syntax :

trains.push({
    name : "name",
    display_name : "display_name",
    id : "id",
    color: "#00FF00",
    stations : [
        ["station1", "sort name", "num1"],
        ["station2", "sort name", "num2"],
    ],
    //opt
    direct : { 
      "train" : "station",
    },
    loop : bool
});

*/

trains.push({
  name: "参電本線",
  id: "",
  color: "#762f07",
  stations: [
    ["参電喇畳丁", "さんでんらたた", ""],
    ["三代", "みつしろ", ""],
    ["参電三代", "さんでんみつしろ", ""],
    ["夕陽ヶ丘", "ゆうひがおか", ""],
    ["大参道", "おおさんどう", ""],
    ["手我沼", "てがぬま", ""],
    ["小鳥原口", "ひととばらぐち", ""],
  ]
});

trains.push({
  name: "朝鉄本線",
  id: "AS",
  color: "#0271d0",
  stations: [
    ["五鉄高台", "ごてつたかだい", ""],
    ["本町（朝鉄高台）", "ほんまちあさてつたかだい", "01"],
    ["一村", "いちむら", "02"],
    ["初原", "はつはら", "03"],
    ["湿塚", "しめつか", "04"],
    ["緒山", "おやま", "05"],
    ["百地", "ももち", "06"],
    ["きつね山", "きつねやま", "07"],
    ["朝井", "あさい", "08"],
    ["高科", "たかしな", "09"],
    ["坂奈", "さかな", "10"],
    ["新楡野", "しんにれの", "11"],
    ["稲宮", "いなみや", "12"],
    ["六花", "りっか", "13"],
    ["七椿", "ななつばき", "14"],
    ["凍海", "いづみ", "15"],
    ["東果町（朝鉄）", "とうかまち", "16"],
    ["高松山", "たかまつやま", "17"],
  ],
  direct: {
    "五鉄中央線": "五鉄高台",
  }
});

trains.push({
  name: "朝鉄明神線",
  id: "AM",
  color: "#0271d0",
  stations: [
    ["朝井", "あさい", "08"],
    ["明神口", "みょうじんぐち", "09"],
    ["明神", "みょうじん", "10"],
    ["九条", "くじょう", "11"],
    ["守南花", "もりなか", "12"],
  ],
  direct: {
    "市鉄彩麗線": "守南花",
  }
});

trains.push({
  name: "朝鉄城山線",
  id: "AR",
  color: "#0271d0",
  stations: [
    ["新楡野", "しんにれの", "11"],
    ["日池", "ひのいけ", "12"],
    ["つくも浜", "つくもはま", "13"],
    ["快草平", "よぐだいら", "14"],
    ["仙河", "せんが", "15"],
    ["城山下", "しろやました", "16"],
  ]
});

trains.push({
  name: "朝鉄城山ケーブル線",
  id: "AR",
  color: "#00b7ce",
  stations: [
    ["城山下", "しろやました", "16"],
    ["城山上", "しろやまうえ", "17"],
  ]
});

trains.push({
  name: "五鉄中央線",
  id: "GC",
  color: "#eb5c01",
  stations: [
    ["五鉄高台", "ごてつたかだい", "01"],
    ["北矢野", "きたやの", "02"],
    ["ひまわりの里", "ひまわりのさと", "03"],
    ["菊舎", "きくやど", "04"],
    ["五色", "ごしき", "05"],
    ["緋ヶ丘", "あかがおか", "06"],
    ["恋来", "こいらい", "07"],
    ["寥鈴", "りょうりん", "08"],
    ["翠咲", "すいしょう", "09"],
    ["薔薇山", "ばらやま", "10"],
    ["平氷", "ひらこおり", "11"],
    ["鼓町", "つづみまち", "12"],
    ["石花", "いしばな", "13"],
  ],
  direct: {
    "朝鉄本線": "五鉄高台",
    "五鉄中央本線": "石花",
  }
});

trains.push({
  name: "五鉄中央本線",
  id: "GC",
  color: "#eb5c01",
  stations: [
    ["石花", "いしばな", "14"],
    ["本部湖", "もとぶこ", "15"],
    ["瓜川", "うりかわ", "16"],
    ["稲垣", "いながき", "17"],
    ["夏丘", "なつおか", "18"],
  ],
  direct: {
    "五鉄中央線": "石花",
  }
});

trains.push({
  name: "五鉄五色線",
  id: "GS",
  color: "#eb5c01",
  stations: [
    ["五色", "ごしき", "01"],
    ["牛木", "うしぎ", "02"],
    ["金香", "こんこう", "03"],
    ["ライラック公園", "らいらっくこうえん", "04"],
    ["矢車", "やぐるま", "05"],
    ["金糸雀原", "かなりあのはら", "06"],
    ["小野木", "おのぎ", "07"],
    ["刀祢口", "とねぐち", "08"],
    ["西橘八重", "にしきつばえ", "09"],
    ["旭平", "あさひだいら", "10"],
    ["上沢", "かみさわ", "11"],
    ["池森", "いけもり", "12"],
    ["樺谷", "かばだに", "13"],
    ["春日台", "かすがだい", "14"],
    ["西原", "にしはら", "15"],
    ["小屋松", "こやまつ", "16"],
    ["四季咲", "しきざき", "17"],
  ],
  direct: {
    "五鉄五珊線": "五色",
  }
});

trains.push({
  name: "五鉄五珊線",
  id: "GN",
  color: "#ffcc00",
  stations: [
    ["五色", "ごしき", "01"],
    ["新菊舎", "しんきくやど", "02"],
    ["高嶺", "たかね", "03"],
    ["高嶺口", "たかねぐち", "04"],
    ["金泉", "かないずみ", "05"],
    ["南金泉", "みなみかないずみ", "06"],
    ["珊瑚口", "さんごぐち", "07"],
  ],
  direct: {
    "五鉄五色線": "五色",
  }
});

trains.push({
  name: "五鉄日咲線",
  id: "GI",
  color: "#00a064",
  stations: [
    ["鵺恋中央", "ぬえこいちゅうおう", "01"],
    ["日咲", "ひさき", "02"],
    ["金泉", "かないずみ", "03"],
    ["東金泉", "ひがしかないずみ", "04"],
    ["北幼潮", "きたさなしお", "05"],
    ["幼潮", "さなしお", ""],
  ]
});

trains.push({
  name: "五鉄日咲線",
  id: "GI",
  color: "#00a064",
  stations: [
    ["東金泉", "ひがしかないずみ", "04"],
    ["潤平", "うるひら", "51"],
  ]
});

trains.push({
  name: "五鉄刀祢線",
  id: "GO",
  color: "#00beff",
  stations: [
    ["刀祢口", "とねぐち", "01"],
    ["刀祢本町", "とねほんまち", "02"],
    ["林町", "はやしちょう", "03"],
    ["船尾", "ふなお", "04"],
    ["遊佐", "ゆさ", "05"],
    ["横川", "よこかわ", "06"],
  ]
});

trains.push({
  name: "五鉄夏樺線",
  id: "",
  color: "#85c023",
  stations: [
    ["夏丘", "なつおか", ""],
    ["真壁大池", "まかべおおいけ", ""],
    ["穴山口", "あなやまぐち", ""],
    ["大赤谷", "おおあかだに", ""],
    ["遊佐", "ゆさ", ""],
    ["森ノ浦", "もりのうら", ""],
    ["細谷", "ほそや", ""],
    ["真壁二川", "まかべふたがわ", ""],
    ["丸島", "まるしま", ""],
    ["真壁雲雀丘", "まかべひばりがおか", ""],
    ["砂山", "すなやま", ""],
    ["樺谷", "かばだに", ""],
  ]
});

trains.push({
  name: "峰和貨物線",
  id: "",
  color: "#ee7800",
  stations: [
    ["歩坂埠頭", "ほさかふとう", ""],
    ["大峰和", "おおみねわ", ""],
  ]
});

trains.push({
  name: "地下鉄星ノ宮線",
  id: "HS",
  color: "#6473ce",
  stations: [
    ["伊吹", "いぶき", "01"],
    ["雨取", "あまとり", "02"],
    ["奥村", "おくむら", "03"],
    ["北鹿島", "きたかしま", "04"],
    ["苗場", "なえば", "05"],
    ["宿木", "やどりぎ", "06"],
    ["星ノ宮", "ほしのみや", "07"],
    ["街道端", "かいどうばた", "08"],
  ],
  loop : true
});

trains.push({
  name: "市鉄本線",
  id: "IR",
  color: "#61187c",
  stations: [
    ["高台", "たかだい", "01"],
    ["水谷", "みずたに", "02"],
    ["丸山", "まるやま", "03"],
    ["山吹", "やまぶき", "04"],
    ["草船", "くさぶね", "05"],
    ["花園", "はなぞの", "06"],
    ["明神", "みょうじん", "07"],
    ["東明神", "ひがしみょうじん", "08"],
    ["七椿", "ななつばき", "09"],
    ["時庭真中", "ときにわまなか", "10"],
    ["矢吹町", "やぶきまち", "11"],
    ["九絵山口", "ここのえやまぐち", "12"],
  ],
  direct: {
    "雲鉄金時線全線": "高台",
  }
});

trains.push({
  name: "市鉄彩麗線",
  id: "XI",
  color: "#35399d",
  stations: [
    ["千夜舞村", "ちやまむら", "13"],
    ["守南花", "もりなか", "14"],
  ],
  direct: {
    "朝鉄明神線": "守南花",
  }
});

trains.push({
  name: "市鉄琳廻線",
  id: "RK",
  color: "#8e8e86",
  stations: [
    ["明神", "みょうじん", "01"],
    ["新明神", "しんみょうじん", "02"],
    ["南明神", "みなみみょうじん", "03"],
    ["守南花", "もりなか", "04"],
    ["白雪", "しらゆき", "05"],
    ["東明神", "ひがしみょうじん", "06"],
    ["虎川", "とらかわ", "07"],
    ["大空", "おおぞら", "08"],
  ],
  loop : true
});

trains.push({
  name: "市鉄千夜舞線",
  id: "CY",
  color: "#f8c627",
  stations: [
    ["山吹", "やまぶき", "01"],
    ["牛込", "うしごめ", "02"],
    ["戸山", "とやま", "03"],
    ["水樹", "みなき", "04"],
    ["桃園", "ももぞの", "05"],
    ["河間", "かわま", "06"],
    ["海音", "うみね", "07"],
    ["一条", "いちじょう", "08"],
    ["桜町", "さくらまち", "09"],
    ["天草", "あまくさ", "10"],
    ["千夜舞村", "ちやまむら", "11"],
    ["松越", "まつこし", "12"],
    ["真中新町", "まなかしんまち", "13"],
    ["珠桜", "たまさくら", "14"],
    ["時庭真中", "ときにわまなか", "15"],
    ["琴森", "こともり", "16"],
    ["高松山", "たかまつやま", "17"],
  ]
});

trains.push({
  name: "市鉄矢吹線",
  id: "YK",
  color: "#f5ad3b",
  stations: [
    ["明神", "みょうじん", "07"],
    ["東明神", "ひがしみょうじん", "08"],
    ["朽梨台", "くちなしだい", "09"],
    ["神端", "かみはし", "10"],
    ["七椿", "ななつばき", "11"],
    ["羽根井", "はねい", "12"],
    ["珠桜", "たまさくら", "13"],
    ["時庭真中", "ときにわまなか", "14"],
    ["瀬名町", "せなまち", "15"],
    ["南真中", "みなみまなか", "16"],
    ["朝明ノ月", "あさけのつき", "17"],
    ["苔岩海岸", "こけいわかいがん", "18"],
    ["矢吹町", "やぶきまち", "19"],
    ["万朶野", "ばんだの", "20"],
    ["九絵山口", "ここのえやまぐち", "21"],
  ]
});

trains.push({
  name: "いのりまち咲繚線",
  id: "SR",
  color: "#339900",
  stations: [
  ]
});

trains.push({
  name: "鏡島臨海鉄道かがみらい線",
  id: "KB",
  color: "#016af8",
  stations: [
    ["甕川", "かめかわ", "01"],
    ["北甕川", "きたかめかわ", "02"],
    ["望月黒野", "もちづきくろの", "03"],
    ["百花島", "ひゃっかじま", "04"],
    ["望月空猫", "もちづきそらねこ", "05"],
    ["鏡島橋", "かがしまばし", "06"],
    ["鏡島", "かがしま", "07"],
  ]
});

trains.push({
  name: "雉鉄本線",
  id: "KH",
  color: "#006699",
  stations: [
    ["雉鉄高台", "きじてつたかだい", "01"],
    ["下ノ辻", "しものつじ", "02"],
    ["岸川", "きしかわ", "03"],
    ["坤果橋", "こうがばし", "04"],
    ["枯茶平", "かれちゃだいら", "05"],
    ["高嶺口", "たかねぐち", "06"],
    ["東御水池", "ひがしおみずいけ", "07"],
    ["鵺恋中央", "ぬえこいちゅうおう", "08"],
    ["守台", "もりだい", "09"],
    ["蛇番", "へびばん", "10"],
    ["紅摘台", "ぐつみだい", "11"],
  ]
});

trains.push({
  name: "雉鉄海岸線",
  id: "KK",
  color: "#006699",
  stations: [
    ["鵺恋中央", "ぬえこいちゅうおう", "01"],
    ["暁闇渓", "ぎょうあんだに", ""],
    ["新碑文田", "しんひもんだ", "02"],
    ["新月町", "しんげつちょう", "03"],
    ["船見", "ふなみ", "04"],
  ]
});

trains.push({
  name: "合野本線",
  id: "AN",
  color: "#0099ff",
  stations: [
    ["仙河", "せんが", "01"],
    ["颯冴", "さつさえ", "02"],
    ["快草", "よぐ", "03"],
    ["エナカピア", "えなかぴあ", "04"],
    ["水無原", "みなはら", "05"],
  ]
});

trains.push({
  name: "笛舞本線",
  id: "FM",
  color: "#0099ff",
  stations: [
    ["沓形", "くつがた", "13"],
    ["門", "もん", "14"],
    ["水月湖", "すいげつこ", "15"],
  ],
  direct: {
    "一村線全線": "沓形",
  }
});

trains.push({
  name: "一村線全線",
  display_name : "一村線",
  id: "IC",
  color: "#0099ff",
  stations: [
    ["仙河", "せんが", "01"],
    ["擶野", "たまの", "02"],
    ["瑠璃野", "るりの", "03"],
    ["戌月", "いぬづき", "04"],
    ["初原", "はつはら", "05"],
    ["一村", "いちむら", "06"],
    ["高台", "たかだい", "07"],
    ["金泉", "かないずみ", "08"],
    ["綺華", "きら", "09"],
    ["霜鯨", "しもくじら", "10"],
    ["浜江", "はまえ", "11"],
    ["鴫ノ巣", "しぎのす", "12"],
    ["沓形", "くつがた", "13"],
  ],
    direct: {
    "真壁本線": "沓形",
    "笛舞本線": "沓形",
  }
});

trains.push({
  name: "一村線直通用",
  display_name : "一村線",
  id: "IC",
  color: "#0099ff",
  stations: [
    ["擶野", "たまの", "02"],
    ["瑠璃野", "るりの", "03"],
    ["戌月", "いぬづき", "04"],
    ["初原", "はつはら", "05"],
    ["一村", "いちむら", "06"],
    ["高台", "たかだい", "07"],
    ["金泉", "かないずみ", "08"],
    ["綺華", "きら", "09"],
    ["霜鯨", "しもくじら", "10"],
    ["浜江", "はまえ", "11"],
    ["鴫ノ巣", "しぎのす", "12"],
    ["沓形", "くつがた", "13"],
  ],
    direct: {
    "快北線": "擶野",
    "真壁本線": "沓形",
    "笛舞本線": "沓形",
  }
});

trains.push({
  name: "真壁本線",
  id: "IC",
  color: "#0099ff",
  stations: [
    ["沓形", "くつがた", "13"],
    ["泪岩", "なみだいわ", "14"],
    ["大解", "おおとけ", "15"],
    ["真壁市", "まかべし", "16"],
    ["藤堂", "とうどう", "17"],
    ["緒平", "おびら", "18"],
  ],
  direct: {
    "一村線全線": "沓形",
  }
});

trains.push({
  name: "快北線",
  id: "IC",
  color: "#FF0000",
  stations: [
    ["擶野", "たまの", "02"],
    ["錦木", "にしきぎ", "51"],
  ],
  direct: {
    "一村線直通用": "擶野",
    "鴻江線": "錦木",
  }
});

trains.push({
  name: "岸川線全線",
  display_name: "岸川線",
  id: "KW",
  color: "#339900",
  stations: [
    ["高台", "たかだい", "01"],
    ["岸川", "きしかわ", "02"],
    ["心愛", "ここあ", "03"],
    ["沼井", "ぬまい", "04"],
    ["金泉", "かないずみ", "05"],
    ["碑文田", "ひもんだ", "06"],
    ["新碑文田", "しんひもんだ", "07"],
    ["綺華", "きら", "08"],
    ["広川", "ひろかわ", "09"],
    ["霜鯨", "しもくじら", "10"],
    ["添吹", "そえぶき", "11"],
    ["上浜江", "かみはまえ", "12"],
    ["浜江", "はまえ", "13"],
  ],
  direct: {
    "木津池線": "高台",
  }
});

trains.push({
  name: "岸川線直通用",
  display_name: "岸川線",
  id: "KW",
  color: "#339900",
  stations: [
    ["高台", "たかだい", "01"],
    ["岸川", "きしかわ", "02"],
    ["心愛", "ここあ", "03"],
    ["沼井", "ぬまい", "04"],
    ["金泉", "かないずみ", "05"],
    ["碑文田", "ひもんだ", "06"],
    ["新碑文田", "しんひもんだ", "07"],
    ["綺華", "きら", "08"],
  ],
  direct: {
    "木津池線": "高台",
  }
});

trains.push({
  name: "矢野線",
  id: "YN",
  color: "#ff0000",
  stations: [
    ["高台", "たかだい", "14"],
    ["矢野", "やの", "15"],
    ["ひまわりの里", "ひまわりのさと", "16"],
    ["因町", "ちなみまち", "17"],
    ["燧灘", "ひうちなだ", "18"],
    ["有明池田", "ありあけいけだ", "19"],
    ["沼影", "ぬまかげ", "20"],
    ["有明秋山", "ありあけあきやま", "21"],
    ["有明白坂", "ありあけしらさか", "22"],
    ["紅葉谷", "もみじだに", "23"],
    ["有明村上", "ありあけむらかみ", "24"],
    ["赤崎", "あかさき", "25"],
  ],
  direct: {
    "桜庭線": "高台",
  }
});

trains.push({
  name: "すいひん線",
  id: "SU",
  color: "#0066ff",
  stations: [
    ["高台", "たかだい", "14"],
    ["浮島", "うきしま", "15"],
    ["水谷", "みずたに", "16"],
    ["潤平", "うるひら", "17"],
    ["芦珂水郷", "ろかすいごう", "18"],
    ["幼潮", "さなしお", "19"],
    ["幼潮浦里", "さなしおうらさと", "20"],
    ["周央町", "すおうちょう", "21"],
    ["船見", "ふなみ", "22"],
    ["甘姫", "あまひめ", "23"],
    ["藍染", "あいぞめ", "24"],
    ["霜鯨", "しもくじら", "25"],
    ["添吹", "そえぶき", "26"],
    ["上浜江", "かみはまえ", "27"],
    ["浜江", "はまえ", "28"],
  ],
  direct: {
    "桜庭線": "高台",
  }
});

trains.push({
  name: "桜庭線",
  id: "SK",
  color: "#ff99cc",
  stations: [
    ["仙河", "せんが", "01"],
    ["毛屋", "けや", "02"],
    ["楡野", "にれの", "03"],
    ["虎川", "とらかわ", "04"],
    ["明神市", "みょうじんし", "05"],
    ["花園城址公園", "はなぞのじょうしこうえん", "06"],
    ["桜見丘", "さくらみおか", "07"],
    ["山入", "やまいり", "08"],
    ["勿咲", "なさき", "09"],
    ["漆ノ森", "しちのもり", "10"],
    ["草船", "くさぶね", "11"],
    ["初春", "ういはる", "12"],
    ["一村", "いちむら", "13"],
    ["高台", "たかだい", "14"],
  ],
  direct: {
    "矢野線": "高台",
    "すいひん線": "高台",
  }
});

trains.push({
  name: "藤和線",
  id: "TW",
  color: "#ffc20e",
  stations: [
    ["仙河", "せんが", "01"],
    ["毛屋", "けや", "02"],
    ["百舌鳥岸", "もずぎし", "03"],
    ["擶野", "たまの", "04"],
    ["十倉", "とくら", "05"],
    ["唐垣", "からがき", "06"],
    ["瑠璃野", "るりの", "07"],
    ["冠風", "かむりかぜ", "08"],
    ["本柚", "もとゆず", "09"],
    ["戌月", "いぬづき", "10"],
    ["藤和", "とうわ", "11"],
    ["赤沢鹿島", "あかざわかしま", "12"],
    ["漣", "さざなみ", "13"],
    ["燧灘", "ひうちなだ", "14"],
  ]
});

trains.push({
  name: "木津池線",
  id: "ZC",
  color: "#ff5500",
  stations: [
    ["高台", "たかだい", "01"],
    ["北高台", "きたたかだい", "02"],
    ["赤沢鹿島", "あかざわかしま", "03"],
    ["雨取", "あまとり", "04"],
    ["伊吹", "いぶき", "05"],
    ["丹花", "たんが", "06"],
    ["小豆沢", "あずさわ", "07"],
    ["蔵間", "くらま", "08"],
    ["一柳", "ひとつやなぎ", "09"],
    ["みのり木下", "みのりきのした", "10"],
    ["宮藤", "みやふじ", "11"],
    ["美農緑", "みのりみどり", "12"],
    ["才川", "さいかわ", "13"],
    ["木津池", "きづち", "14"],
  ],
  direct: {
    "岸川線全線": "高台",
    "岸川線直通用": "高台",
  }
});

trains.push({
  name: "照井浜線全線",
  display_name: "照井浜線",
  id: "TR",
  color: "#ff8110",
  stations: [
    ["苺氷", "いちごおり", "01"],
    ["碓氷", "うすい", "02"],
    ["北瑠璃野", "きたるりの", "03"],
    ["瑠璃野", "るりの", "04"],
    ["唐垣", "からがき", "05"],
    ["枢池", "くるるいけ", "06"],
    ["宮尾", "みやお", "07"],
    ["照井", "てるい", "08"],
    ["朝井", "あさい", "09"],
    ["紡木町", "つむぎちょう", "10"],
    ["桜見丘", "さくらみおか", "11"],
    ["一軒在家", "いっけんざいけ", "12"],
    ["桜町", "さくらまち", "13"],
    ["後桜町", "ごさくらまち", "14"],
    ["海咲野", "みさきの", "15"],
    ["下ノ浜", "しものはま", "16"],
    ["入潟", "いりがた", "17"],
    ["灘島", "なだしま", "18"],
    ["望月瀬戸", "もちづきせと", "19"],
    ["小桜", "こざくら", "20"],
  ]
});

trains.push({
  name: "照井浜線直通用",
  display_name: "照井浜線",
  id: "TR",
  color: "#ff8110",
  stations: [
    ["苺氷", "いちごおり", "01"],
    ["碓氷", "うすい", "02"],
    ["北瑠璃野", "きたるりの", "03"],
    ["瑠璃野", "るりの", "04"],
    ["唐垣", "からがき", "05"],
    ["枢池", "くるるいけ", "06"],
    ["宮尾", "みやお", "07"],
    ["照井", "てるい", "08"],
    ["朝井", "あさい", "09"],
    ["紡木町", "つむぎちょう", "10"],
    ["桜見丘", "さくらみおか", "11"],
    ["一軒在家", "いっけんざいけ", "12"],
    ["桜町", "さくらまち", "13"],
    ["後桜町", "ごさくらまち", "14"],
    ["海咲野", "みさきの", "15"],
  ]
});

trains.push({
  name: "照井浜線支線",
  display_name: "照井浜線",
  id: "TR",
  color: "#ff8110",
  stations: [
    ["海咲野", "みさきの", "15"],
    ["波稲", "はいね", "51"],
  ],
  direct: {
    "照井浜線直通用": "海咲野",
  }
});

trains.push({
  name: "ローゼンライン",
  id: "RM",
  color: "#990000",
  stations: [
    ["燈羽", "あかりば", "01"],
    ["金糸雀原", "かなりあのはら", "02"],
    ["翠咲", "すいしょう", "03"],
    ["蒼散", "あおちる", "04"],
    ["紅摘", "ぐつみ", "05"],
    ["苺野", "いちごの", "06"],
    ["綺華", "きら", "07"],
  ],
  direct: {
    "岸川線直通用": "海咲野",
  }
});

trains.push({
  name: "鴻江線全線",
  display_name: "鴻江線",
  id: "NE",
  color: "#ff9999",
  stations: [
    ["仙河", "せんが", "01"],
    ["快草玉城", "よぐたまき", "02"],
    ["三保田", "みほた", "03"],
    ["錦木", "にしきぎ", "04"],
    ["越後屋", "えちごや", "05"],
    ["快草一方井", "よぐいっかたい", "06"],
    ["春瀬", "はるせ", "07"],
    ["快草丹花", "よぐたんが", "08"],
    ["宇氷麓", "うひろく", "09"],
    ["日御向", "ひのみむかい", "10"],
    ["鴻江", "こうのえ", "11"],
  ]
});

trains.push({
  name: "鴻江線直通用",
  display_name: "鴻江線",
  id: "NE",
  color: "#ff9999",
  stations: [
    ["錦木", "にしきぎ", "04"],
    ["越後屋", "えちごや", "05"],
    ["快草一方井", "よぐいっかたい", "06"],
    ["春瀬", "はるせ", "07"],
    ["快草丹花", "よぐたんが", "08"],
    ["宇氷麓", "うひろく", "09"],
    ["日御向", "ひのみむかい", "10"],
    ["鴻江", "こうのえ", "11"],
  ],
  direct: {
    "快北線": "錦木",
  }
});

trains.push({
  name: "柳樽線全線",
  display_name: "柳樽線",
  id: "GT",
  color: "#9999ff",
  stations: [
    ["仙河", "せんが", "01"],
    ["快草玉城", "よぐたまき", "02"],
    ["三保田", "みほた", "03"],
    ["錦木", "にしきぎ", "04"],
    ["うみがめ海岸", "うみがめかいがん", "05"],
    ["石蕗", "つわぶき", "06"],
    ["樽前", "たるまえ", "07"],
    ["美甘蓮實", "みかもはすみ", "08"],
    ["円池", "まるいけ", "09"],
    ["来夏", "こなつ", "10"],
    ["東日岡", "ひがしひおか", "11"],
    ["西日岡", "にしひおか", "12"],
    ["苺氷", "いちごおり", "13"],
    ["野々", "のの", "14"],
    ["雪平", "ゆきひら", "15"],
    ["一柳", "ひとつやなぎ", "16"],
    ["楓ノ浜", "かえでのはま", "17"],
    ["藤崎台", "ふじさきだい", "18"],
    ["新条町", "しんじょうまち", "19"],
    ["大参道", "おおさんどう", "20"],
    ["赤崎", "あかさき", "21"],
    ["衛湖原", "えごはら", "22"],
    ["競馬場前", "けいばじょうまえ", "23"],
    ["十九浦", "つくうら", "24"],
    ["有明蒲原", "ありあけかんばら", "25"],
    ["酢漿飛鳥", "かたばみあすか", "26"],
    ["燈羽", "あかりば", "27"],
    ["橘八重", "きつばえ", "28"],
    ["刀祢口", "とねぐち", "29"],
    ["平氷", "ひらこおり", "30"],
    ["北浜江", "きたはまえ", "31"],
    ["浜江", "はまえ", "32"],
  ]
});

trains.push({
  name: "柳樽線直通用1",
  display_name: "柳樽線",
  id: "GT",
  color: "#9999ff",
  stations: [
    ["仙河", "せんが", "01"],
    ["快草玉城", "よぐたまき", "02"],
    ["三保田", "みほた", "03"],
    ["錦木", "にしきぎ", "04"],
    ["うみがめ海岸", "うみがめかいがん", "05"],
    ["石蕗", "つわぶき", "06"],
    ["樽前", "たるまえ", "07"],
    ["美甘蓮實", "みかもはすみ", "08"],
    ["円池", "まるいけ", "09"],
    ["来夏", "こなつ", "10"],
    ["東日岡", "ひがしひおか", "11"],
    ["西日岡", "にしひおか", "12"],
    ["苺氷", "いちごおり", "13"],
    ["野々", "のの", "14"],
    ["雪平", "ゆきひら", "15"],
    ["一柳", "ひとつやなぎ", "16"],
    ["楓ノ浜", "かえでのはま", "17"],
    ["藤崎台", "ふじさきだい", "18"],
    ["新条町", "しんじょうまち", "19"],
  ],
  direct: {
    "打羽線": "新条町",
  }
});

trains.push({
  name: "柳樽線直通用2",
  display_name: "柳樽線",
  id: "GT",
  color: "#9999ff",
  stations: [
    ["有明蒲原", "ありあけかんばら", "25"],
    ["酢漿飛鳥", "かたばみあすか", "26"],
    ["燈羽", "あかりば", "27"],
    ["橘八重", "きつばえ", "28"],
    ["刀祢口", "とねぐち", "29"],
    ["平氷", "ひらこおり", "30"],
    ["北浜江", "きたはまえ", "31"],
    ["浜江", "はまえ", "32"],
  ],
  direct: {
    "打羽線": "有明蒲原",
  }
});

trains.push({
  name: "打羽線",
  id: "GT",
  color: "#999999",
  stations: [
    ["新条町", "しんじょうまち", "19"],
    ["手結赤座", "ていあかざ", "70"],
    ["親跡", "ちかあと", "71"],
    ["打羽", "うちばね", "72"],
    ["本燧灘", "ほんひうちなだ", "73"],
    ["燧灘", "ひうちなだ", "74"],
    ["有明蒲原", "ありあけかんばら", "25"],
  ],
  direct: {
    "柳樽線直通用1": "新条町",
    "柳樽線直通用2": "有明蒲原",
  }
});

trains.push({
  name: "望月本線全線",
  display_name: "望月本線",
  id: "MC",
  color: "#7e6ca8",
  stations: [
    ["水無原", "みなはら", "01"],
    ["エナカピア", "えなかぴあ", "02"],
    ["快草", "よぐ", "03"],
    ["樹", "いつき", "04"],
    ["西白木", "にししらき", "05"],
    ["東果町（衣鉄）", "とうかまち", "06"],
    ["高松山", "たかまつやま", "07"],
    ["時庭真中", "ときにわまなか", "08"],
    ["朝明ノ月", "あさけのつき", "09"],
    ["望月矢吹", "もちづきやぶき", "10"],
    ["望月瀬戸", "もちづきせと", "11"],
    ["上迫", "うえさこ", "12"],
    ["天童寺", "てんどうじ", "13"],
    ["小井口", "こいぐち", "14"],
    ["桐山", "きりやま", "15"],
    ["禍沼", "まがぬま", "16"],
    ["歸山", "かえりやま", "17"],
    ["骨矢", "ほねや", "18"],
    ["風花", "かざはな", "19"],
    ["望月聖", "もちづきひじり", "20"],
    ["夜明遊園", "よあけゆうえん", "21"],
    ["芹沢", "せりざわ", "22"],
    ["茜金", "あいかね", "23"],
    ["東緒平", "ひがしおびら", "24"],
    ["緒平", "おびら", "25"],
  ]
});

trains.push({
  name: "望月本線直通用",
  display_name: "望月本線",
  id: "MC",
  color: "#7e6ca8",
  stations: [
    ["水無原", "みなはら", "01"],
    ["エナカピア", "えなかぴあ", "02"],
    ["快草", "よぐ", "03"],
    ["樹", "いつき", "04"],
    ["西白木", "にししらき", "05"],
    ["東果町（衣鉄）", "とうかまち", "06"],
    ["高松山", "たかまつやま", "07"],
    ["時庭真中", "ときにわまなか", "08"],
    ["朝明ノ月", "あさけのつき", "09"],
    ["望月矢吹", "もちづきやぶき", "10"],
    ["望月瀬戸", "もちづきせと", "11"],
    ["上迫", "うえさこ", "12"],
    ["天童寺", "てんどうじ", "13"],
  ],
  direct: {
    "望月本線支線": "天童寺",
  }
});

trains.push({
  name: "望月本線支線",
  display_name: "望月本線",
  id: "MC",
  color: "#7e6ca8",
  stations: [
    ["天童寺", "てんどうじ", "13"],
    ["赤尾関", "あかおぜき", "51"],
    ["夢津", "ゆめつ", "52"],
  ],
  direct: {
    "望月本線直通用": "天童寺",
  }
});

trains.push({
  name: "ネザーエクスプレスA線",
  id: "A",
  color: "#ff00ff",
  stations: [
    ["茸之島", "たけのしま", "01"],
    ["中熱川", "なかあたがわ", "02"],
    ["あられ平", "あられだいら", "03"],
    ["茜金", "あいかね", "04"],
    ["骨矢", "ほねや", "05"],
    ["神殿前", "しんでんまえ", "06"],
    ["珊瑚口", "さんごぐち", "07"],
    ["高台", "たかだい", "08"],
    ["燧灘", "ひうちなだ", "09"],
    ["赤崎", "あかさき", "10"],
    ["一柳", "ひとつやなぎ", "11"],
  ]
});

trains.push({
  name: "ネザーエクスプレスB線",
  id: "B",
  color: "#0000ff",
  stations: [
    ["高台", "たかだい", "01"],
    ["熊高", "くまだか", "02"],
    ["夢津", "ゆめつ", "03"],
    ["神殿前", "しんでんまえ", "04"],
    ["海月", "みつき", "05"],
    ["真壁周防町", "まかべすおうまち", "06"],
    ["菱崎", "ひしざき", "07"],
  ]
});

trains.push({
  name: "ネザーエクスプレスC線",
  id: "C",
  color: "#70b919",
  stations: [
    ["高台", "たかだい", "01"],
    ["勿咲", "なさき", "02"],
    ["明神市", "みょうじんし", "03"],
    ["仙河", "せんが", "04"],
  ]
});

trains.push({
  name: "雲鉄金時線全線",
  display_name: "雲鉄金時線",
  id: "KT",
  color: "#8cc806",
  stations: [
    ["高台", "たかだい", ""],
    ["鈴音", "すずね", "02"],
    ["皐月", "さつき", "03"],
    ["漣", "さざなみ", "04"],
    ["十路", "とおじ", "05"],
    ["打羽", "うちばね", "06"],
    ["檜畔", "ひぼとり", "07"],
    ["有明秋山", "ありあけあきやま", "08"],
    ["成田裏", "なりたうら", "09"],
    ["競馬場前", "けいばじょうまえ", "10"],
    ["月岬", "つくのみさき", "11"],
    ["三代", "みつしろ", "12"],
    ["汐景", "しおかげ", "13"],
    ["遊行", "ゆぎょう", "14"],
    ["夏泊", "なつどまり", "15"],
    ["冬中火", "とうちゅうか", "16"],
    ["四季咲", "しきざき", "17"],
    ["大瀬", "おおせ", "18"],
  ],
  direct: {
    "市鉄本線": "高台",
  }
});

trains.push({
  name: "雲鉄金時線直通用",
  display_name: "雲鉄金時線",
  id: "KT",
  color: "#8cc806",
  stations: [
    ["鈴音", "すずね", "02"],
    ["皐月", "さつき", "03"],
    ["漣", "さざなみ", "04"],
    ["十路", "とおじ", "05"],
    ["打羽", "うちばね", "06"],
    ["檜畔", "ひぼとり", "07"],
    ["有明秋山", "ありあけあきやま", "08"],
    ["成田裏", "なりたうら", "09"],
    ["競馬場前", "けいばじょうまえ", "10"],
    ["月岬", "つくのみさき", "11"],
    ["三代", "みつしろ", "12"],
    ["汐景", "しおかげ", "13"],
    ["遊行", "ゆぎょう", "14"],
    ["夏泊", "なつどまり", "15"],
    ["冬中火", "とうちゅうか", "16"],
    ["四季咲", "しきざき", "17"],
    ["大瀬", "おおせ", "18"],
  ]
});

trains.push({
  name: "雲鉄金時線支線",
  display_name: "雲鉄金時線",
  id: "KT",
  color: "#8cc806",
  stations: [
    ["高台市", "たかだいし", "01"],
    ["鈴音", "すずね", "02"],
  ],
  direct: {
    "雲鉄金時線直通用": "鈴音",
  }
});

trains.push({
  name: "雲鉄伊吹線全線",
  display_name: "雲鉄伊吹線",
  id: "KI",
  color: "#8cc806",
  stations: [
    ["鵺恋中央", "ぬえこいちゅうおう", "01"],
    ["緋ヶ丘", "あかがおか", "02"],
    ["五色", "ごしき", "03"],
    ["久川", "ひさかわ", "04"],
    ["燧灘", "ひうちなだ", "05"],
    ["十路", "とおじ", "06"],
    ["苗場", "なえば", "07"],
    ["伊吹", "いぶき", "08"],
    ["檜木谷", "ひのきだに", "09"],
    ["風蓮峠", "ふうれんとうげ", "10"],
    ["碓氷", "うすい", "11"],
    ["菖蒲", "しょうぶ", "12"],
    ["白砂", "しらすな", "13"],
    ["中海", "なかうみ", "14"],
    ["凪崎", "なぎさき", "15"],
    ["樽前", "たるまえ", "16"],
    ["上樽前", "かみたるまえ", "17"],
    ["大洞", "おおぼら", "18"],
    ["霧原", "きりはら", "19"],
    ["日御", "ひのみ", "20"],
  ],
  direct: {
    "雉鉄海岸線": "鵺恋中央",
  }
});

trains.push({
  name: "雲鉄伊吹線直通用1",
  display_name: "雲鉄伊吹線",
  id: "KI",
  color: "#8cc806",
  stations: [
    ["鵺恋中央", "ぬえこいちゅうおう", "01"],
    ["緋ヶ丘", "あかがおか", "02"],
    ["五色", "ごしき", "03"],
    ["久川", "ひさかわ", "04"],
    ["燧灘", "ひうちなだ", "05"],
    ["十路", "とおじ", "06"],
    ["苗場", "なえば", "07"],
    ["伊吹", "いぶき", "08"],
    ["檜木谷", "ひのきだに", "09"],
    ["風蓮峠", "ふうれんとうげ", "10"],
    ["碓氷", "うすい", "11"],
    ["菖蒲", "しょうぶ", "12"],
  ],
  direct: {
    "雉鉄海岸線": "鵺恋中央",
    "雲鉄天蒲線": "菖蒲",
  }
});

trains.push({
  name: "雲鉄伊吹線直通用2",
  display_name: "雲鉄伊吹線",
  id: "KI",
  color: "#8cc806",
  stations: [
    ["鵺恋中央", "ぬえこいちゅうおう", "01"],
    ["緋ヶ丘", "あかがおか", "02"],
    ["五色", "ごしき", "03"],
    ["久川", "ひさかわ", "04"],
    ["燧灘", "ひうちなだ", "05"],
    ["十路", "とおじ", "06"],
    ["苗場", "なえば", "07"],
    ["伊吹", "いぶき", "08"],
  ],
  direct: {
    "雲鉄森山線": "伊吹",
  }
});

trains.push({
  name: "雲鉄天蒲線",
  id: "KA",
  color: "#8cc806",
  stations: [
    ["菖蒲", "しょうぶ", "01"],
    ["仏稜", "ふつりょう", "02"],
    ["唐垣", "からがき", "03"],
    ["巌松岳", "がんしょうだけ", "04"],
    ["宮尾", "みやお", "05"],
    ["樫ノ橋", "かしのばし", "06"],
    ["桜見丘", "さくらみおか", "07"],
    ["東平", "とうへい", "08"],
    ["天草", "あまくさ", "09"],
  ],
  direct: {
    "雲鉄伊吹線直通用1": "菖蒲",
  }
});

trains.push({
  name: "雲鉄銀木線",
  id: "KG",
  color: "#8cc806",
  stations: [
    ["銀鏡", "しろみ", "01"],
    ["美甘蓮實", "みかもはすみ", "02"],
    ["樽前", "たるまえ", "03"],
    ["石蕗", "つわぶき", "04"],
    ["うみがめ海岸", "うみがめかいがん", "05"],
    ["錦木", "にしきぎ", "06"],
  ]
});

trains.push({
  name: "雲鉄森山線",
  id: "KS",
  color: "#8cc806",
  stations: [
    ["伊吹", "いぶき", "05"],
    ["星ノ宮", "ほしのみや", "06"],
    ["入谷山", "いりややま", "07"],
    ["赤座東", "あかざひがし", "08"],
    ["新条町", "しんじょうまち", "09"],
  ],
  direct: {
    "雲鉄伊吹線直通用2": "伊吹",
  }
});

trains.push({
  name: "ネザーエクスプレスD線",
  id: "D",
  color: "#ff0000",
  stations: [
    ["船見", "ふなみ", "01"],
    ["緋ヶ丘", "あかがおか", "02"],
    ["燧灘", "ひうちなだ", "03"],
    ["伊吹", "いぶき", "04"],
    ["菖蒲", "しょうぶ", "05"],
    ["樽前", "たるまえ", "06"],
    ["霧原", "きりはら", "07"],
  ]
});

trains.push({
  name: "ネザーエクスプレスE線",
  id: "E",
  color: "#00ccff",
  stations: [
    ["高台市", "たかだい", "01"],
    ["伊吹", "いぶき", "02"],
    ["打羽", "うちばね", "03"],
    ["競馬場前", "けいばじょうまえ", "04"],
    ["遊行", "ゆぎょう", "05"],
    ["四季咲", "しきざき", "06"],
  ]
});

trains.push({
  name: "永吉金工なんほく線A線",
  id: "NA",
  color: "#616650",
  stations: [
    ["霜鯨", "しもくじら", "01"],
    ["霜鯨口", "しもくじらぐち", "02"],
    ["深苺野", "しんいちごの", "03"],
    ["深寥鈴", "しんりょうりん", "04"],
    ["深矢車", "しんやぐるま", "05"],
    ["東燐羽（深飛鳥）", "ひがしりんは", "06"],
    ["深高坂氷山", "しんこうさかひょうざん", "07"],
    ["胅カルスト南", "てつかるすとみなみ", "08"],
    ["胅カルスト北", "てつかるすときた", "09"],
    ["喇畳丁", "らたた", "10"],
    ["深遊行", "しんゆぎょう", "11"],
    ["遊行口", "ゆぎょうぐち", "12"],
    ["夏泊", "なつどまり", "13"],
  ]
});

trains.push({
  name: "永吉金工なんほく線B線",
  id: "NB",
  color: "#616650",
  stations: [
    ["深霜鯨", "しんしもくじら", "02"],
    ["深苺野", "しんいちごの", "03"],
  ]
});

trains.push({
  name: "七鉄元丘線",
  id: "NM",
  color: "#c7b83b",
  stations: [
    ["幼潮", "さなしお", "01"],
    ["繁吹島", "しぶきじま", "02"],
    ["北夢津", "きたゆめつ", "03"],
    ["夢津", "ゆめつ", "04"],
    ["兆野", "きざしの", "05"],
    ["本出浜", "もといではま", "06"],
    ["対原", "ついばら", "07"],
    ["深口", "ふかぐち", "08"],
    ["神鳴杣", "かんなりそま", "09"],
    ["向杉温泉", "むこうすぎおんせん", "10"],
    ["採瑠璃里", "とるりり", "11"],
    ["歸山", "かえりやま", "12"],
  ],
  direct: {
    "五鉄日咲線": "幼潮",
  }
});

trains.push({
  name: "七鉄馬場線",
  id: "NB",
  color: "#f1becb",
  stations: [
    ["向杉温泉", "むこうすぎおんせん", "01"],
    ["室咲", "むろさき", "02"],
    ["小石間", "こいしま", "03"],
    ["須与", "すよ", "04"],
    ["夜明遊園", "よあけゆうえん", "05"],
    ["このみ台", "このみだい", "06"],
    ["甕川", "かめかわ", "07"],
    ["入方", "いりがた", "08"],
    ["茜金", "あいかね", "09"],
  ]
});

trains.push({
  name: "一村貨物線",
  id: "",
  color: "#6ec81d",
  stations: [
    ["高台(貨)", "たかだいかもつ", ""],
    ["一村団地", "いちむらだんち", ""],
  ]
});

trains.push({
  name: "仙高貨物線",
  id: "",
  color: "#206f09",
  stations: [
    ["緒山貨物ターミナル", "おやまかもつたーみなる", ""],
    ["桜庭(貨)", "さくらばかもつ", ""],
  ]
});

trains.push({
  name: "緒山市内線",
  id: "CT",
  color: "#00b7ce",
  stations: [
    ["森谷", "もりや", "01"],
    ["三乃橋", "さんのはし", "02"],
    ["ちさと台", "ちさとだい", "03"],
    ["市役所前（緒山市）", "しやくしょまえ", "04"],
    ["駅前通り", "えきまえどおり", "05"],
    ["緒山駅前", "おやまえきまえ", "06"],
  ],
  direct: {
    "ｽﾁｭｱｰﾄﾗﾑ緒山十路線": "森谷",
  }
});

trains.push({
  name: "地下鉄南北線",
  id: "N",
  color: "#00a5bf",
  stations: [
    ["勿咲", "なさき", "01"],
    ["あさぎ山", "あさぎやま", "02"],
    ["緒山", "おやま", "03"],
    ["市役所", "しやくしょ", "04"],
    ["松ヶ池", "まつがいけ", "05"],
    ["羽入", "はにゅう", "06"],
    ["白樺本郷", "しらかばほんごう", "07"],
    ["瑠璃野", "るりの", "08"],
  ]
});

trains.push({
  name: "銀河鉄道線",
  id: "GE",
  color: "#141519",
  stations: [
    ["地終本島", "ちのばてほんとう", "01"],
    ["世終", "よのはて", "02"],
  ]
});

trains.push({
  name: "草春鉄道草春線",
  id: "",
  color: "#ff9d02",
  stations: [
    ["快草", "よぐ", ""],
    ["北快草", "きたよぐ", ""],
  ],
  direct: {
    "草春鉄道快草線": "北快草",
  }
});

trains.push({
  name: "草春鉄道快草線",
  id: "",
  color: "#ff9d02",
  stations: [
    ["北快草", "きたよぐ", ""],
    ["快草丹花", "よぐたんが", ""],
  ],
  direct: {
    "草春鉄道草春線": "北快草",
  }
});

trains.push({
  name: "ｽﾁｭｱｰﾄﾗﾑ五色環状線",
  display_name : "スチュアートラム五色環状線",
  id: "S",
  color: "#554171",
  stations: [
    ["五色駅前", "ごしきえきまえ", ""],
    ["倉台", "くらだい", ""],
    ["牛木駅前", "うしぎえきまえ", ""],
    ["牛木車庫前", "うしぎしゃこまえ", ""],
    ["大賀", "おおが", ""],
    ["千野", "せんの", ""],
    ["蛇川橋", "へびかわばし", ""],
    ["牧井坂", "まきいざか", ""],
    ["林戸橋", "はやしどばし", ""],
  ],
  loop : true
});

trains.push({
  name: "ｽﾁｭｱｰﾄﾗﾑ赤沢凪窪線",
  display_name : "スチュアートラム赤沢凪窪線",
  id: "S",
  color: "#554171",
  stations: [
    ["赤沢鹿島", "あかざわかしま", ""],
    ["都電鹿島", "とでんかしま", ""],
    ["元牛巻", "もとうしまき", ""],
    ["さざなみ南", "さざなみみなみ", ""],
    ["さざなみ西", "さざなみにし", ""],
    ["境池", "さかいいけ", ""],
    ["表", "おもて", ""],
    ["燧灘口", "ひうちなだぐち", ""],
    ["燧灘駅前", "ひうちなだえきまえ", ""],
    ["麗", "うらら", ""],
    ["凪窪", "なぎくぼ", ""],
    ["伊根", "いね", ""],
    ["泉元", "いずみもと", ""],
    ["大賀", "おおが", ""],
  ]
});

trains.push({
  name: "ｽﾁｭｱｰﾄﾗﾑ緒山十路線",
  display_name : "スチュアートラム緒山十路線",
  id: "S",
  color: "#554171",
  stations: [
    ["森谷", "もりや", ""],
    ["初原", "はつはら", ""],
    ["一村三十二丁目", "いちむらさんじゅうにちょうめ", ""],
    ["一村落合", "いちむらおちあい", ""],
    ["砂口", "すなぐち", ""],
    ["北高台", "きたたかだい", ""],
    ["都電皐月", "とでんさつき", ""],
    ["漣大橋", "さざなみおおはし", ""],
    ["さざなみ南", "さざなみみなみ", ""],
    ["さざなみ北", "さざなみきた", ""],
    ["十路", "とおじ", ""],
  ],
  direct: {
    "緒山市内線": "森谷",
  }
});

trains.push({
  name: "ｽﾁｭｱｰﾄﾗﾑ高台線",
  display_name : "スチュアートラム高台線",
  id: "S",
  color: "#554171",
  stations: [
    ["高台駅前", "たかだいえきまえ", ""],
    ["一村", "いちむら", ""],
    ["一村落合", "いちむらおちあい", ""],
  ]
});

trains.push({
  name: "ｽﾁｭｱｰﾄﾗﾑ因町線",
  display_name : "スチュアートラム因町線",
  id: "S",
  color: "#554171",
  stations: [
    ["北高台", "きたたかだい", ""],
    ["皐月駅前", "さつえきまえ", ""],
    ["桜花", "おうか", ""],
    ["因町駅前", "ちなみまちえきまえ", ""],
    ["牧井坂", "まきいざか", ""],
  ]
});

trains.push({
  name: "地下鉄水面線",
  id: "M",
  color: "#ff0000",
  stations: [
    ["有明蒲原", "ありあけかんばら", "01"],
    ["東蒲原", "ひがしかんばら", "02"],
    ["伊根", "いね", "03"],
    ["泉元", "いずみもと", "04"],
    ["千野", "せんの", "05"],
    ["市役所前（五色市）", "しやくしょまえ", "06"],
    ["五色", "ごしき", "07"],
    ["蓮水面台", "はすみなもだい", "08"],
    ["鵺恋中央", "ぬえこいちゅうおう", "09"],
  ]
});

trains.push({
  name: "菱電本線",
  id: "",
  color: "#b8c0cc",
  stations: [
    ["鴫ノ巣", "しぎのす", ""],
    ["本鷸巣", "ほんしぎのす", ""],
    ["南鷸巣", "みなみしぎのす", ""],
    ["鷸巣大橋", "しぎのすおおはし", ""],
    ["柿浦", "かきうら", ""],
    ["雪之津", "ゆきのつ", ""],
    ["南雪之津", "みなみゆきのつ", ""],
    ["天々座", "てでざ", ""],
    ["歩坂口", "ほさかぐち", ""],
    ["菱崎築港", "ひしざきちっこう", ""],
    ["菱崎", "ひしざき", ""],
  ]
});

trains.push({
  name: "菱電小萩線",
  id: "",
  color: "#b8c0cc",
  stations: [
    ["雪之津", "ゆきのつ", ""],
    ["西雪之津", "にしゆきのつ", ""],
    ["小萩温泉", "こはぎおんせん", ""],
  ]
});

trains.push({
  name: "菱電浜江線",
  id: "",
  color: "#b8c0cc",
  stations: [
    ["浜江", "はまえ", ""],
    ["原ヶ峠", "はらがたお", ""],
    ["南浜江", "みなみはまえ", ""],
    ["植林場", "しょくりんじょう", ""],
    ["柿浦", "かきうら", ""],
  ]
});

trains.push({
  name: "菱電浜江線",
  id: "",
  color: "#b8c0cc",
  stations: [
    ["中央浜江", "ちゅうおうはまえ", ""],
    ["原ヶ峠", "はらがたお", ""],
  ]
});

trains.push({
  name: "菱電田海線",
  id: "",
  color: "#6cc24a",
  stations: [
    ["菱崎築港", "ひしざきちっこう", ""],
    ["里塚", "りづか", ""],
    ["北田海", "きたたなみ", ""],
    ["絵堂", "えどう", ""],
    ["樺島", "かばしま", ""],
    ["田海美浜", "たなみみはま", ""],
    ["開智", "かいち", ""],
    ["入方", "いりがた", ""],
    ["大釜の滝", "おおがまのたき", ""],
    ["桐間", "きりま", ""],
    ["鍬之下", "くわのした", ""],
    ["緒平", "おびら", ""],
  ]
});

trains.push({
  name: "菱電甕川線",
  id: "",
  color: "#6cc24a",
  stations: [
    ["田海美浜", "たなみみはま", ""],
    ["百鰐岩", "ひゃくわにいわ", ""],
    ["甕川", "かめかわ", ""],
  ]
});

trains.push({
  name: "菱電茜金線",
  id: "",
  color: "#6cc24a",
  stations: [
    ["入方", "いりがた", ""],
    ["茜金", "あいかね", ""],
  ]
});

trains.push({
  name: "菱崎市内線1系統",
  id: "",
  color: "#fe0000",
  stations: [
    ["大手町", "おおてまち", ""],
    ["島津橋", "しまづばし", ""],
    ["市立図書館前", "しりつとしょかんまえ", ""],
    ["北桟橋通り", "きたさんばしどおり", ""],
    ["菱崎駅前", "ひしざきえきまえ", ""],
    ["新湊", "しんみなと", ""],
    ["南桟橋（旅客ターミナル前）", "みなみさんばし", ""],
    ["天主堂下", "てんしゅどうした", ""],
  ]
});

trains.push({
  name: "菱崎市内線2系統",
  id: "",
  color: "#ffdd00",
  stations: [
    ["築港（市役所前）", "ちっこう", ""],
    ["島津橋", "しまづばし", ""],
    ["市立図書館前", "しりつとしょかんまえ", ""],
    ["北桟橋通り", "きたさんばしどおり", ""],
    ["菱崎駅前", "ひしざきえきまえ", ""],
    ["海岸通り", "かいがんどおり", ""],
    ["築港南口（電鉄前）", "ちっこうみなみぐち", ""],
    ["金星通り", "きんせいどおり", ""],
    ["里塚駅前", "りづかえきまえ", ""],
    ["追分橋", "おいわけばし", ""],
    ["ハミングロード", "はみんぐろーど", ""],
    ["大手町（南側）", "おおてまち", ""],
    ["大手町", "おおてまち", ""],
    ["飴島町", "あめしまちょう", ""],
    ["歩坂新町", "ほさかしんまち", ""],
  ]
});

trains.push({
  name: "菱崎市内線3系統",
  id: "",
  color: "#96d35f",
  stations: [
    ["大手町", "おおてまち", ""],
    ["島津橋", "しまづばし", ""],
    ["市立図書館前", "しりつとしょかんまえ", ""],
    ["北桟橋通り", "きたさんばしどおり", ""],
    ["菱崎駅前", "ひしざきえきまえ", ""],
    ["海岸通り", "かいがんどおり", ""],
    ["築港南口（電鉄前）", "ちっこうみなみぐち", ""],
    ["金星通り", "きんせいどおり", ""],
    ["里塚駅前", "りづかえきまえ", ""],
    ["凱旋通り", "がいせんどおり", ""],
    ["旗上公園", "はたああげこうえん", ""],
    ["旗上車庫", "はたあげしゃこ", ""],
    ["赤星町", "あかほしまち", ""],
    ["星谷", "ほしたに", ""],
  ]
});

var walk_data = [];

/*
  徒歩圏内データ登録エリア
  syntax :
  
  walk_data.push([
    [station1, station2],
    [sort_name1, sort_name2],
  ]);
  
*/

walk_data.push([
  ["きつね山", "樫ノ橋"],
  ["きつねやま", "かしのばし"],
]);

walk_data.push([
  ["新楡野", "楡野"],
  ["しんにれの", "にれの"],
]);

walk_data.push([
  ["東果町（朝鉄）", "東果町（衣鉄）"],
  ["とうかまち", "とうかまち"],
]);

walk_data.push([
  ["五鉄高台", "高台市"],
  ["ごてつたかだい", "たかだいし"],
]);

walk_data.push([
  ["珊瑚口", "周央町"],
  ["さんごぐち", "すおうちょう"],
]);

walk_data.push([
  ["岸川", "矢野"],
  ["きしかわ", "やの"],
]);

walk_data.push([
  ["紡木町", "花園"],
  ["つむぎちょう", "はなぞの"],
]);

walk_data.push([
  ["花園城址公園", "明神"],
  ["はのぞのじょうしこうえん", "みょうじん"],
]);

walk_data.push([
  ["高台", "本町（朝鉄高台）"],
  ["たかだい", "ほんまちあさてつたかだい"],
]);

walk_data.push([
  ["紅摘", "紅摘台"],
  ["ぐつみ", "ぐつみだい"],
]);

walk_data.push([
  ["北鹿島", "都電鹿島"],
  ["きたかしま", "とでんかしま"],
]);

walk_data.push([
  ["緒山", "緒山駅前"],
  ["おやま", "おやまえきまえ"],
]);

walk_data.push([
  ["五色", "五色駅前"],
  ["ごしき", "ごしきえきまえ"],
]);

walk_data.push([
  ["牛木", "牛木駅前"],
  ["うしぎ", "うしぎえきまえ"],
]);

walk_data.push([
  ["燧灘", "燧灘駅前"],
  ["ひうちなだ", "ひうちなだえきまえ"],
]);

walk_data.push([
  ["高台", "高台駅前"],
  ["たかだい", "たかだいえきまえ"],
]);

walk_data.push([
  ["皐月", "皐月駅前"],
  ["さつき", "さつきえきまえ"],
]);

walk_data.push([
  ["因町", "因町駅前"],
  ["ちなみまち", "ちなみまちえきまえ"],
]);

walk_data.push([
  ["菱崎", "菱崎駅前"],
  ["ひしざき", "ひしざきえきまえ"],
]);

walk_data.push([
  ["里塚", "里塚駅前"],
  ["りづか", "りづかえきまえ"],
]);

