
var trains = [];
//路線データ登録エリア
/* syntax :

trains.push({
    name : "name",
    display_name : "display_name",
    id : "id",
    color: "#00FF00",
    stations : [
        ["station1", "sort name", "num1"],
        ["station2", "sort name", "num2"],
    ],
    //opt
    direct : { 
      "train" : "station",
    },
    loop : bool
});

*/

trains.push({
  name: "一村線全線",
  display_name : "一村線",
  id: "IC",
  color: "#0099FF",
  stations: [
    ["仙河", "せんが", "01"],
    ["擶野", "たまの", "02"],
    ["瑠璃野", "るりの", "03"],
    ["戌月", "いぬづき", "04"],
    ["初原", "はつはら", "05"],
    ["一村", "いちむら", "06"],
    ["高台", "たかだい", "07"],
    ["金泉", "かないずみ", "08"],
    ["綺華", "きら", "09"],
    ["霜鯨", "しもくじら", "10"],
    ["浜江", "はまえ", "11"],
    ["鴫ノ巣", "しぎのす", "12"],
    ["沓形", "くつがた", "13"],
  ]
});

trains.push({
  name: "一村線直通用",
  display_name : "一村線",
  id: "IC",
  color: "#0099FF",
  stations: [
    ["擶野", "たまの", "02"],
    ["瑠璃野", "るりの", "03"],
    ["戌月", "いぬづき", "04"],
    ["初原", "はつはら", "05"],
    ["一村", "いちむら", "06"],
    ["高台", "たかだい", "07"],
    ["金泉", "かないずみ", "08"],
    ["綺華", "きら", "09"],
    ["霜鯨", "しもくじら", "10"],
  ]
});

trains.push({
  name: "快北線",
  id: "IC",
  color: "#FF0000",
  stations: [
    ["錦木", "にしきぎ", "51"],
    ["擶野", "たまの", "02"],
  ],
  direct: {
    "一村線直通用": "擶野",
  }
});

trains.push({
  name: "岸川線全線",
  display_name : "一村線",
  id: "KW",
  color: "#339900",
  stations: [
    ["高台", "たかだい", "01"],
    ["岸川", "きしかわ", "02"],
    ["心愛", "ここあ", "03"],
    ["沼井", "ぬまい", "04"],
    ["金泉", "かないずみ", "05"],
    ["碑文田", "ひもんだ", "06"],
    ["新碑文田", "しんひもんだ", "07"],
    ["綺華", "きら", "08"],
    ["広川", "ひろかわ", "09"],
    ["霜鯨", "しもくじら", "10"],
    ["添吹", "そえぶき", "11"],
    ["上浜江", "かみはまえ", "12"],
    ["浜江", "はまえ", "13"],
  ],
  direct: {
    "木津池線": "高台",
  }
});

trains.push({
  name: "岸川線直通用",
  display_name : "岸川線",
  id: "KW",
  color: "#339900",
  stations: [
    ["高台", "たかだい", "01"],
    ["岸川", "きしかわ", "02"],
    ["心愛", "ここあ", "03"],
    ["沼井", "ぬまい", "04"],
    ["金泉", "かないずみ", "05"],
    ["碑文田", "ひもんだ", "06"],
    ["新碑文田", "しんひもんだ", "07"],
    ["綺華", "きら", "08"],
  ],
  direct: {
    "木津池線": "高台",
  }
});

trains.push({
  name: "藤和線",
  id: "TW",
  color: "#C0C040",
  stations: [
    ["仙河", "せんが", "01"],
    ["毛屋", "けや", "02"],
    ["百舌鳥岸", "もずぎし", "03"],
    ["擶野", "たまの", "04"],
    ["十倉", "とくら", "05"],
    ["唐垣", "からがき", "06"],
    ["瑠璃野", "るりの", "07"],
    ["冠風", "かむりかぜ", "08"],
    ["本柚", "もとゆず", "09"],
    ["戌月", "いぬづき", "10"],
    ["藤和", "とうわ", "11"],
    ["赤沢鹿島", "あかざわかしま", "12"],
    ["漣", "さざなみ", "13"],
    ["燧灘", "ひうちなだ", "14"],
  ]
});

trains.push({
  name: "桜庭線",
  id: "SK",
  color: "#FF66FF",
  stations: [
    ["仙河", "せんが", "01"],
    ["毛屋", "けや", "02"],
    ["楡野", "にれの", "03"],
    ["虎川", "とらかわ", "04"],
    ["明神市", "みょうじんし", "05"],
    ["花園城址公園", "はなぞのじょうしこうえん", "06"],
    ["桜見丘", "さくらみおか", "07"],
    ["山入", "やまいり", "08"],
    ["勿咲", "なさき", "09"],
    ["漆ノ森", "しちのもり", "10"],
    ["草船", "くさぶね", "11"],
    ["初春", "ういはる", "12"],
    ["一村", "いちむら", "13"],
    ["高台", "たかだい", "14"],
  ],
});

trains.push({
  name: "すいひん線",
  id: "SU",
  color: "#0060FF",
  stations: [
    ["高台", "たかだい", "10"],
    ["浮島", "うきしま", "11"],
    ["水谷", "みずたに", "12"],
    ["潤平", "うるひら", "13"],
    ["芦珂水郷", "ろかすいごう", "14"],
    ["幼潮", "さなしお", "15"],
    ["幼潮浦里", "さなしおうらさと", "16"],
    ["周央町", "すおうちょう", "17"],
    ["船見", "ふなみ", "18"],
    ["甘姫", "あまひめ", "19"],
    ["藍染", "あいぞめ", "20"],
    ["霜鯨", "しもくじら", "21"],
    ["添吹", "そえぶき", "22"],
    ["上浜江", "かみはまえ", "23"],
    ["浜江", "はまえ", "24"],
  ],
  direct: {
    "桜庭線": "高台",
  }
});

trains.push({
  name: "矢野線",
  id: "YN",
  color: "#FF0000",
  stations: [
    ["高台", "たかだい", "14"],
    ["矢野", "やの", "15"],
    ["ひまわりの里", "ひまわりのさと", "16"],
    ["因町", "ちなみまち", "17"],
    ["燧灘", "ひうちなだ", "18"],
    ["有明池田", "ありあけいけだ", "19"],
    ["沼影", "ぬまかげ", "20"],
    ["有明秋山", "ありあけあきやま", "21"],
    ["有明白坂", "ありあけしらさか", "22"],
    ["紅葉谷", "もみじだに", "23"],
    ["有明村上", "ありあけむらかみ", "24"],
    ["赤崎", "あかさき", "25"],
  ],
  direct: {
    "桜庭線": "高台",
  }
});

trains.push({
  name: "木津池線",
  id: "ZC",
  color: "#FF5500",
  stations: [
    ["高台", "たかだい", "01"],
    ["北高台", "きたたかだい", "02"],
    ["赤沢鹿島", "あかざわかしま", "03"],
    ["雨取", "あまとり", "04"],
    ["伊吹", "いぶき", "05"],
    ["丹花", "たんが", "06"],
    ["小豆沢", "あずさわ", "07"],
    ["蔵間", "くらま", "08"],
    ["一柳", "ひとつやなぎ", "09"],
    ["みのり木下", "みのりきのした", "10"],
    ["宮藤", "みやふじ", "11"],
    ["美農緑", "みのりみどり", "12"],
    ["才川", "さいかわ", "13"],
    ["木津池", "きづち", "14"],
  ],
  direct: {
    "岸川線": "高台",
  }
});

trains.push({
  name: "照井浜線（本線）",
  display_name : "照井浜線",
  id: "TR",
  color: "#FF8110",
  stations: [
    ["苺氷", "いちごおり", "01"],
    ["碓氷", "うすい", "02"],
    ["北瑠璃野", "きたるりの", "03"],
    ["瑠璃野", "るりの", "04"],
    ["唐垣", "からがき", "05"],
    ["枢池", "くるるいけ", "06"],
    ["宮尾", "みやお", "07"],
    ["照井", "てるい", "08"],
    ["朝井", "あさい", "09"],
    ["紡木町", "つむぎちょう", "10"],
    ["桜見丘", "さくらみおか", "11"],
    ["一軒在家", "いっけんざいけ", "12"],
    ["桜町", "さくらまち", "13"],
    ["後桜町", "ごさくらまち", "14"],
    ["海咲野", "みさきの", "15"],
    ["下ノ浜", "しものはま", "16"],
    ["入潟", "いりがた", "17"],
    ["灘島", "なだしま", "18"],
    ["望月瀬戸", "もちづきせと", "19"],
    ["小桜", "こざくら", "20"],
  ]
});

trains.push({
  name: "照井浜線（本線）",
  display_name : "照井浜線",
  id: "TR",
  color: "#FF8110",
  stations: [
    ["苺氷", "いちごおり", "01"],
    ["碓氷", "うすい", "02"],
    ["北瑠璃野", "きたるりの", "03"],
    ["瑠璃野", "るりの", "04"],
    ["唐垣", "からがき", "05"],
    ["枢池", "くるるいけ", "06"],
    ["宮尾", "みやお", "07"],
    ["照井", "てるい", "08"],
    ["朝井", "あさい", "09"],
    ["紡木町", "つむぎちょう", "10"],
    ["桜見丘", "さくらみおか", "11"],
    ["一軒在家", "いっけんざいけ", "12"],
    ["桜町", "さくらまち", "13"],
    ["後桜町", "ごさくらまち", "14"],
    ["海咲野", "みさきの", "15"],
    ["波稲", "はいね", "51"],
  ]
});

trains.push({
  name: "ローゼンライン",
  id: "RM",
  color: "#990000",
  stations: [
    ["燈羽", "あかりば", "01"],
    ["金糸雀原", "かなりあのはら", "02"],
    ["翠咲", "すいしょう", "03"],
    ["蒼散", "あおちる", "04"],
    ["紅摘", "ぐつみ", "05"],
    ["苺野", "いちごの", "06"],
    ["綺華", "きら", "07"],
  ],
  direct: {
    "岸川線直通用": "綺華",
  }
});

trains.push({
  name: "銀木線",
  id: "KG",
  color: "#339966",
  stations: [
    ["銀鏡", "しろみ", "04"],
    ["美甘蓮實", "みかもはすみ", "05"],
    ["樽前", "たるまえ", "06"],
    ["石蕗", "つわぶき", "07"],
    ["うみがめ海岸", "うみがめかいがん", "08"],
    ["錦木", "にしきぎ", "09"],
  ]
});

trains.push({
  name: "鴻江線",
  id: "NE",
  color: "#FF9999",
  stations: [
    ["仙河", "せんが", "01"],
    ["快草玉城", "よぐたまき", "02"],
    ["三保田", "みほた", "03"],
    ["錦木", "にしきぎ", "04"],
    ["越後屋", "えちごや", "05"],
    ["快草一方井", "よぐいっかたい", "06"],
    ["春瀬", "はるせ", "07"],
    ["快草丹花", "よぐたんが", "08"],
    ["宇氷麓", "うひろく", "09"],
    ["日御向", "ひのみむかい", "10"],
    ["鴻江", "こうのえ", "11"],
  ]
});

trains.push({
  name: "柳樽線",
  id: "GT",
  color: "#9999FF",
  stations: [
    ["仙河", "せんが", "01"],
    ["快草玉城", "よぐたまき", "02"],
    ["三保田", "みほた", "03"],
    ["錦木", "にしきぎ", "04"],
    ["うみがめ海岸", "うみがめかいがん", "05"],
    ["石蕗", "つわぶき", "06"],
    ["樽前", "たるまえ", "07"],
    ["美甘蓮實", "みかもはすみ", "08"],
    ["円池", "まるいけ", "09"],
    ["来夏", "こなつ", "10"],
    ["東日岡", "ひがしひおか", "11"],
    ["西日岡", "にしひおか", "12"],
    ["苺氷", "いちごおり", "13"],
    ["野々", "のの", "14"],
    ["雪平", "ゆきひら", "15"],
    ["一柳", "ひとつやなぎ", "16"],
    ["楓ノ浜", "かえでのはま", "17"],
    ["藤崎台", "ふじさきだい", "18"],
    ["新条町", "しんじょうまち", "19"],
    ["大参道", "おおさんどう", "20"],
    ["赤崎", "あかさき", "21"],
    ["衛湖原", "えごはら", "22"],
    ["競馬場前", "けいばじょうまえ", "23"],
    ["十九浦", "つくうら", "24"],
    ["有明蒲原", "ありあけかんばら", "25"],
    ["酢漿飛鳥", "かたばみあすか", "26"],
    ["燈羽", "あかりば", "27"],
    ["橘八重", "きつばえ", "28"],
    ["刀祢口", "とねぐち", "29"],
    ["平氷", "ひらこおり", "30"],
    ["北浜江", "きたはまえ", "31"],
    ["浜江", "はまえ", "32"],
  ]
});

trains.push({
  name: "NetherExpA線",
  id: "A",
  color: "#FF00FF",
  stations: [
    ["茸之島", "たけのしま", "01"],
    ["中熱川", "なかあたがわ", "02"],
    ["あられ平", "あられだいら", "03"],
    ["茜金", "あいかね", "04"],
    ["骨矢", "ほねや", "05"],
    ["神殿前", "しんでんまえ", "06"],
    ["珊瑚口", "さんごぐち", "07"],
    ["高台", "たかだい", "08"],
    ["燧灘", "ひうちなだ", "09"],
    ["赤崎", "あかさき", "10"],
    ["一柳", "ひとつやなぎ", "11"],
  ]
});

trains.push({
  name: "NetherExpB線",
  id: "B",
  color: "#0000FF",
  stations: [
    ["高台", "たかだい", "01"],
    ["熊高", "くまだか", "02"],
    ["夢津", "ゆめつ", "03"],
    ["神殿前", "しんでんまえ", "04"],
    ["海月", "みつき", "05"],
    ["真壁周防町", "まかべすおうまち", "06"],
    ["菱崎", "ひしざき", "07"],
  ]
});

trains.push({
  name: "NetherExpC線",
  id: "C",
  color: "#00FF40",
  stations: [
    ["高台", "たかだい", "01"],
    ["勿咲", "なさき", "02"],
    ["明神市", "みょうじんし", "03"],
    ["仙河", "せんが", "04"],
  ]
});

trains.push({
  name: "NetherExpD線",
  id: "D",
  color: "#339966",
  stations: [
    ["船見", "ふなみ", "01"],
    ["緋ヶ丘", "あかがおか", "02"],
    ["地終", "ちのばて", "03"],
    ["伊吹", "いぶき", "04"],
    ["菖蒲", "しょうぶ", "05"],
    ["樽前", "たるまえ", "06"],
    ["霧原", "きりはら", "07"],
  ]
});

trains.push({
  name: "NetherExpE線",
  id: "E",
  color: "#339966",
  stations: [
    ["高台", "たかだい", "01"],
    ["伊吹", "いぶき", "02"],
    ["打羽", "うちばね", "03"],
    ["競馬場前", "けいばじょうまえ", "04"],
    ["遊行", "ゆぎょう", "05"],
    ["四季咲", "しきざき", "06"],
  ]
});

trains.push({
  name: "雉鉄本線",
  id: "KH",
  color: "#006699",
  stations: [
    ["高台", "たかだい", "01"],
    ["下ノ辻", "しものつじ", "02"],
    ["岸川", "きしかわ", "03"],
    ["坤果橋", "こうがばし", "04"],
    ["枯茶平", "かれちゃだいら", "05"],
    ["高嶺口", "たかねぐち", "06"],
    ["東御水池", "ひがしおみずいけ", "07"],
    ["鵺恋中央", "ぬえこいちゅうおう", "08"],
    ["守台", "もりだい", "09"],
    ["蛇番", "へびばん", "10"],
    ["紅摘台", "ぐつみだい", "11"],
  ],
});

trains.push({
  name: "海岸線",
  id: "KK",
  color: "#006699",
  stations: [
    ["鵺恋中央", "ぬえこいちゅうおう", "01"],
    ["暁闇渓【休止中】", "ぎょうあんだに", "--"],
    ["新碑文田", "しんひもんだ", "02"],
    ["新月町", "しんげつちょう", "03"],
    ["船見", "ふなみ", "04"],
  ],
  direct: {
    "伊吹線": "鵺恋中央",
  }
});

trains.push({
  name: "金時線",
  id: "KT",
  color: "#339966",
  stations: [
    ["高台市", "たかだいし", "01"],
    ["鈴音", "すずね", "02"],
    ["皐月", "さつき", "03"],
    ["漣", "さざなみ", "04"],
    ["十路", "とおじ", "05"],
    ["打羽", "うちばね", "06"],
    ["檜畔", "ひぼとり", "07"],
    ["有明秋山", "ありあけあきやま", "08"],
    ["成田裏", "なりたうら", "09"],
    ["競馬場前", "けいばじょうまえ", "10"],
    ["月岬", "つくのみさき", "11"],
    ["三代", "みつしろ", "12"],
    ["汐景", "しおかげ", "13"],
    ["遊行", "ゆぎょう", "14"],
    ["夏泊", "なつどまり", "15"],
    ["冬中火", "とうちゅうか", "16"],
    ["四季咲", "しきざき", "17"],
    ["大瀬", "おおせ", "18"],
  ]
});

trains.push({
  name: "伊吹線",
  id: "KI",
  color: "#339966",
  stations: [
    ["鵺恋中央", "ぬえこいちゅうおう", "01"],
    ["緋ヶ丘", "あかがおか", "02"],
    ["五色", "ごしき", "03"],
    ["久川", "ひさかわ", "04"],
    ["燧灘", "ひうちなだ", "05"],
    ["十路", "とおじ", "06"],
    ["苗場", "なえば", "07"],
    ["伊吹", "いぶき", "08"],
    ["檜木谷", "ひのきだに", "09"],
    ["風蓮峠", "ふうれんとうげ", "10"],
    ["碓氷", "うすい", "11"],
    ["菖蒲", "しょうぶ", "12"],
    ["白砂", "しらすな", "13"],
    ["中海", "なかうみ", "14"],
    ["凪崎", "なぎさき", "15"],
    ["樽前", "たるまえ", "16"],
    ["上樽前", "かみたるまえ", "17"],
    ["大洞", "おおぼら", "18"],
    ["霧原", "きりはら", "19"],
    ["日御", "ひのみ", "20"],
  ],
  direct: {
    "海岸線": "鵺恋中央",
  }
});


trains.push({
  name: "天蒲線",
  id: "KA",
  color: "#339966",
  stations: [
    ["菖蒲", "しょうぶ", "01"],
    ["仏稜", "ふつりょう", "02"],
    ["唐垣", "からがき", "03"],
    ["巌松岳", "がんしょうだけ", "04"],
    ["宮尾", "みやお", "05"],
    ["樫ノ橋", "かしのはし", "06"],
    ["桜見丘", "さくらみおか", "07"],
    ["東平", "とうへい", "08"],
    ["天草", "あまくさ", "09"],
  ]
});

trains.push({
  name: "市鉄本線",
  id: "IR",
  color: "#6600CC",
  stations: [
    ["高台", "たかだい", "01"],
    ["水谷", "みずたに", "02"],
    ["丸山", "まるやま", "03"],
    ["山吹", "やまぶき", "04"],
    ["草船", "くさぶね", "05"],
    ["花園", "はなぞの", "06"],
    ["明神", "みょうじん", "07"],
    ["東明神", "ひがしみょうじん", "08"],
    ["七椿", "ななつばき", "09"],
    ["時庭真中", "ときにわまなか", "10"],
    ["矢吹町", "やぶきまち", "11"],
    ["九絵山口", "ここのえやまぐち", "12"],
  ]
});

trains.push({
  name: "琳廻線",
  id: "RK",
  color: "#515151",
  stations: [
    ["明神", "みょうじん", "01"],
    ["新明神", "しんみょうじん", "02"],
    ["南明神", "みなみみょうじん", "03"],
    ["守南花", "もりなか", "04"],
    ["白雪", "しらゆき", "05"],
    ["東明神", "ひがしみょうじん", "06"],
    ["虎川", "とらかわ", "07"],
    ["大空", "おおぞら", "08"],
  ],
  loop : true
});

trains.push({
  name: "千夜舞線",
  id: "CY",
  color: "F8C627",
  stations: [
    ["山吹", "やまぶき", "01"],
    ["牛込", "うしごめ", "02"],
    ["戸山", "とやま", "03"],
    ["水樹", "みなき", "04"],
    ["桃園", "ももぞの", "05"],
    ["河間", "かわま", "06"],
    ["海音", "うみね", "07"],
    ["一条", "いちじょう", "08"],
    ["桜町", "さくらまち", "09"],
    ["天草", "あまくさ", "10"],
    ["千夜舞村", "ちやまむら", "11"],
    ["松越", "まつこし", "12"],
    ["真中新町", "まなかしんまち", "13"],
    ["珠桜", "たまさくら", "14"],
    ["時庭真中", "ときにわまなか", "15"],
    ["琴森", "こともり", "16"],
    ["高松山", "たかまつやま", "17"],
  ]
});

trains.push({
  name: "彩麗線",
  id: "XI",
  color: "#0000FF",
  stations: [
    ["千夜舞村", "ちやまむら", "13"],
    ["守南花", "もりなか", "14"],
  ]
});

trains.push({
  name: "矢吹線",
  id: "YK",
  color: "#f5ad3b",
  stations: [
    ["明神", "みょうじん", "01"],
    ["東明神", "ひがしみょうじん", "02"],
    ["朽梨台", "くちなしだい", "03"],
    ["神端", "かみはし", "04"],
    ["七椿", "ななつばき", "05"],
    ["羽根井", "はねい", "06"],
    ["珠桜", "たまさくら", "07"],
    ["時庭真中", "ときにわまなか", "08"],
    ["瀬名町", "せなまち", "09"],
    ["南真中", "みなみまなか", "10"],
    ["朝明ノ月", "あさけのつき", "11"],
    ["苔岩海岸", "こけいわかいがん", "12"],
    ["矢吹町", "やぶきまち", "13"],
    ["万朶野", "ばんだの", "14"],
    ["九絵山口", "ここのえやまぐち", "15"],
  ]
});

trains.push({
  name: "中央線",
  id: "GC",
  color: "#EB5C01",
  stations: [
    ["五鉄高台", "ごてつたかだい", "01"],
    ["北矢野", "きたやの", "02"],
    ["ひまわりの里", "ひまわりのさと", "03"],
    ["菊舍", "きくやど", "04"],
    ["五色", "ごしき", "05"],
    ["緋ヶ丘", "あかがおか", "06"],
    ["恋来", "こいらい", "07"],
    ["寥鈴", "りょうりん", "08"],
    ["翠咲", "すいしょう", "09"],
    ["薔薇山", "ばらやま", "10"],
    ["平氷", "ひらこおり", "11"],
    ["鼓町", "つづみまち", "12"],
    ["石花", "いしばな", "13"],
    ["本部湖", "もとぶこ", "14"],
    ["瓜川", "うりかわ", "15"],
    ["稲垣", "いながき", "16"],
    ["夏丘", "なつおか", "17"],
  ]
});

trains.push({
  name: "五色線",
  id: "GS",
  color: "#EB5C01",
  stations: [
    ["五色", "ごしき", "01"],
    ["牛木", "うしぎ", "02"],
    ["金香", "こんこう", "03"],
    ["ライラック公園", "らいらっくこうえん", "04"],
    ["矢車", "やぐるま", "05"],
    ["金糸雀原", "かなりあのはら", "06"],
    ["小野木", "おのぎ", "07"],
    ["刀祢口", "とねぐち", "08"],
    ["西橘八重", "にしきつばえ", "09"],
    ["旭平", "あさひだいら", "10"],
    ["上沢", "かみさわ", "11"],
    ["池森", "いけもり", "12"],
    ["樺谷", "かばだに", "13"],
    ["春日台", "かすがだい", "14"],
    ["西原", "にしはら", "15"],
    ["小屋松", "こやまつ", "16"],
    ["四季咲", "しきざき", "17"],
  ]
});

trains.push({
  name: "五珊線",
  id: "GN",
  color: "#FFCC00",
  stations: [
    ["五色", "ごしき", "01"],
    ["新菊舎", "しんきくやど", "02"],
    ["高嶺", "たかね", "03"],
    ["高嶺口", "たかねぐち", "04"],
    ["金泉", "かないずみ", "05"],
    ["南金泉", "みなみかないずみ", "06"],
    ["珊瑚口", "さんごぐち", "07"],
  ]
});

trains.push({
  name: "朝鉄本線",
  id: "AS",
  color: "#0F0FFF",
  stations: [
    ["五鉄高台", "ごてつたかだい", ""],
    ["本町", "ほんまち", "01"],
    ["一村", "いちむら", "02"],
    ["初原", "はつはら", "03"],
    ["湿塚", "しめつか", "04"],
    ["緒山", "おやま", "05"],
    ["百地", "ももち", "06"],
    ["きつね山", "きつねやま", "07"],
    ["朝井", "あさい", "08"],
    ["高科", "たかしな", "09"],
    ["坂奈", "さかな", "10"],
    ["新楡野", "しんにれの", "11"],
    ["稲宮", "いなみや", "12"],
    ["六花", "りっか", "13"],
    ["七椿", "ななつばき", "14"],
    ["凍海", "いづみ", "15"],
    ["東果町", "ももち", "16"],
    ["高松山", "たかまつやま", "17"],
  ]
});

trains.push({
  name: "朝鉄明神線",
  id: "AS",
  color: "#0F0FFF",
  stations: [
    ["朝井", "あさい", "08"],
    ["明神口", "みょうじんぐち", "09"],
    ["明神", "みょうじん", "10"],
    ["九条", "くじょう", "11"],
    ["守南花", "もりなか", "12"],
  ]
});

trains.push({
  name: "緒山市交通局",
  id: "",
  color: "#00B7CE",
  stations: [
    ["森谷", "もりや", "01"],
    ["三乃橋", "さんのはし", "02"],
    ["ちさと台", "ちさとだい", "03"],
    ["市役所前", "しやくしょまえ", "04"],
    ["駅前通り", "えきまえどおり", "05"],
    ["緒山", "おやま", "01"],
  ]
});

trains.push({
  name: "市内1号線",
    display_name : "市内線",
  id: "S",
  color: "#00B7CE",
  stations: [
    ["漣公園前", "さざなみこうえんまえ", ""],
    ["漣", "さざなみ", ""],
    ["拠点前", "きょてんまえ", ""],
    ["十字街", "じゅうじがい", ""],
    ["暁橋", "あかつきばし", ""],
    ["橋下", "はしもと", ""],
    ["暁", "あかつき", ""],
    ["烏谷", "からすだに", ""],
    ["電鉄鹿島", "でんてつかしま", ""],
  ]
});

trains.push({
  name: "市内5号線",
    display_name : "市内線",
  id: "S",
  color: "#00B7CE",
  stations: [
    ["電鉄皐月", "でんてつさつき", ""],
    ["皐月入口", "さつきいりぐち", ""],
    ["漣大橋", "さざなみおおはし", ""],
    ["大橋入口", "おおはしいりぐち", ""],
    ["十字街", "じゅうじがい", ""],
  ]
});

trains.push({
  name: "市内1号線",
    display_name : "市内線",
  id: "S",
  color: "#00B7CE",
  stations: [
    ["電鉄鹿島", "でんてつかしま", ""],
    ["邸宅前", "ていたくまえ", ""],
    ["沼端", "ぬまはた", ""],
  ]
});

trains.push({
  name: "星ノ宮線",
  id: "",
  color: "#000066",
  stations: [
    ["伊吹", "いぶき", "01"],
    ["雨取", "あまとり", "02"],
    ["奥村", "おくむら", "03"],
    ["北鹿島", "きたかしま", "04"],
    ["苗場", "なえば", "05"],
    ["宿木", "やどりぎ", "06"],
    ["星ノ宮", "ほしのみや", "07"],
    ["街道端", "かいどうばた", "08"],
  ],
  loop : true
});

var walk_data = [];

/*
  徒歩圏内データ登録エリア
  syntax :
  
  walk_data.push([
    [station1, station2],
    [sort_name1, sort_name2],
  ]);
  
*/

walk_data.push([
  ["珊瑚口", "周央町"],
  ["さんごぐち", "すおうちょう"],
]);

walk_data.push([
  ["岸川", "矢野"],
  ["きしかわ", "やの"],
]);

walk_data.push([
  ["紡木町", "花園"],
  ["つむぎちょう", "はなぞの"],
]);

walk_data.push([
  ["花園城址公園", "明神"],
  ["はのぞのじょうしこうえん", "みょうじん"],
]);

walk_data.push([
  ["高台", "本町"],
  ["たかだい", "ほんまち"],
]);

walk_data.push([
  ["紅摘", "紅摘台"],
  ["ぐつみ", "ぐつみだい"],
]);

walk_data.push([
  ["北鹿島", "電鉄鹿島"],
  ["きたかしま", "でんてつかしま"],
]);

